Tekla Open API Reference for Tekla Structures 2025
BoltXYList.GetBoltDistY Method
 Returns the Y distance defined by the argument.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double GetBoltDistY(
	int Index
)
Public Function GetBoltDistY (
	Index As Integer
) As Double
Parameters
Index
Type: System.Int32
The index to the distance list.
Return Value
Type: Double
The distance defined by the argument.
See Also
Reference
BoltXYList Class
Tekla.Structures.Model Namespace